{
  "backend/main.mo": "Defines the backend canister with authorization mixin, topic and subtopic models, user profiles, interval logic, and CRUD/query functions for topics, intervals, schedules, and user settings.",
  "feature_evidence.json": "Lists feature-to-file mappings and evidence metadata for two UI features related to date-based dashboards and subtopic revision navigation.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of all major frontend files, including components, utilities, and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles using OKLCH color values.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, initial loading, profile setup modal, theme provider, and dashboard routing.",
  "frontend/src/components/CalendarView.tsx": "Renders a monthly calendar showing study and revision events with de-duplication, difficulty coloring, and navigation between months.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding, theme toggle, and login/logout logic integrated with Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and saving the profile via a backend mutation.",
  "frontend/src/components/SettingsView.tsx": "Manages user study interval settings with editable difficulty-based intervals and preferred review days, loading defaults and saving updates.",
  "frontend/src/components/SubTopicScheduleView.tsx": "Displays a subtopic’s study date and planned revision schedule with status indicators inside a dialog.",
  "frontend/src/components/TodayView.tsx": "Shows overdue and due-today subtopics for a selected date and allows triggering a review update.",
  "frontend/src/components/TopicDetailView.tsx": "Displays details for a main topic and lists active and completed subtopics with access to each subtopic’s revision schedule.",
  "frontend/src/components/TopicDialog.tsx": "Provides a dialog for creating or editing main topics and subtopics, including difficulty and study date settings.",
  "frontend/src/components/TopicsView.tsx": "UI for listing, expanding, editing, viewing, scheduling, and deleting main topics and subtopics using query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating topics, schedules, and user profiles via the actor.",
  "frontend/src/index.css": "Tailwind setup with extensive CSS variables defining light and dark theme tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Tab-based dashboard switching between Today, Topics, Calendar, and Settings views.",
  "frontend/src/utils/time.ts": "Utility functions for converting ICP Time, comparing dates, and generating normalized date keys.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL or session.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, custom colors, animations, container settings, and plugin setup.",
  "project_state.json": "Stores project metadata, current issues, architectural notes, and lists existing and new feature requests for the study scheduling app."
}