{
  "backend/main.mo": "Main actor implementing a spaced repetition revision tracker with hierarchical topics (MainTopic/SubTopic), revision schedules, user profiles, customizable difficulty-based intervals, and role-based access control via MixinAuthorization.",
  "backend/migration.mo": "Migration module that transforms old actor state to new actor state by adding an `isReviewed` boolean field (defaulted to false) to all existing RevisionSchedule records.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for missed revision tracking: visual indicators in calendar, mark-as-reviewed buttons in TodayView and SubTopicScheduleView, and status transitions from missed to completed.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React files describing components for authentication, topic management, calendar views, revision tracking, and utilities for time/review status calculations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes with purple-blue primary colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication flow with Internet Identity, conditional profile setup modal for new users, theme provider, and dashboard rendering with loading states.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar component displaying study and revision dates with difficulty indicators, red highlighting for missed revisions, date selection to show scheduled topics, and click-through to SubTopicScheduleView.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Header component with app branding, theme toggle (light/dark), and Internet Identity login/logout functionality that clears the query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name for profile setup, preventing dismissal until completed.",
  "frontend/src/components/SettingsView.tsx": "Settings interface for configuring spaced repetition intervals (easy/medium/hard difficulty) and preferred review days of the week, with ability to add/remove custom intervals and reset to defaults.",
  "frontend/src/components/SubTopicScheduleView.tsx": "Modal displaying detailed revision schedule for a subtopic, showing study date, planned review dates, progress tracking, overdue status, and actions to mark as reviewed or reschedule.",
  "frontend/src/components/TodayView.tsx": "Dashboard view showing revisions due today and overdue items for a selected date, with ability to mark revisions as reviewed and filter by date.",
  "frontend/src/components/TopicDetailView.tsx": "Modal dialog displaying a main topic's details and its associated subtopics (active and completed), with ability to view individual subtopic schedules.",
  "frontend/src/components/TopicDialog.tsx": "Tabbed dialog for creating/editing main topics and subtopics, including fields for title, description, difficulty level, study date, and main topic association for subtopics.",
  "frontend/src/components/TopicsView.tsx": "Main topics management component that displays a hierarchical view of main topics and subtopics with collapsible sections, edit/delete/complete actions, and dialogs for creating/editing topics and viewing details.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, creating an authenticated or anonymous actor based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, main topics, subtopics, revision schedules, and planned revision dates with toast notifications for mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, destructive, muted, accent, border, and sidebar color schemes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed navigation between Today, Topics, Calendar, and Settings views using shadcn/ui Tabs component.",
  "frontend/src/utils/reviewStatus.ts": "Utility functions for filtering subtopics by date criteria including due/pending reviews, planned study dates, and identifying missed revision dates from revision schedules.",
  "frontend/src/utils/time.ts": "Utility functions for converting between ICP Time (bigint nanoseconds) and JavaScript Date objects, plus date comparison, formatting, and grouping helpers for calendar functionality.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both query strings and hash-based routing, including sessionStorage persistence for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a revision tracking app implementing manual completion workflow, with features for marking revisions as reviewed and displaying missed revisions in red."
}