{
  "backend/main.mo": "Main actor implementing a spaced repetition system with hierarchical topics (MainTopic/SubTopic), revision schedules, user profiles, customizable intervals per difficulty, and access control authorization.",
  "backend/migration.mo": "Migration module that upgrades RevisionSchedule from V1 (without reviewCount) to V2 (with reviewCount field initialized to 0) while preserving all other state.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: mark-as-reviewed with green indicators, calendar view mark functionality, topics section mark functionality, and review count display across components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for authentication, topic management, calendar views, revision tracking with red/green indicators, review counts, and mark-as-reviewed functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a purple-blue primary color scheme.",
  "frontend/index.html": "HTML entry point for the Spaced Repetition Revision Tracker application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup modal for new users, theme provider, and conditional rendering of dashboard or welcome screen.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar component highlighting missed revisions in red, displaying subtopics for selected dates with green/red status indicators, review counts, and mark-as-reviewed buttons.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with heart icon.",
  "frontend/src/components/Header.tsx": "Header component with branding, theme toggle (light/dark mode), and Internet Identity login/logout functionality that clears query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, preventing dismissal until profile is saved.",
  "frontend/src/components/SettingsView.tsx": "Settings page allowing users to configure revision intervals for easy/medium/hard difficulties and select preferred review days of the week, with ability to add/remove custom intervals and reset to defaults.",
  "frontend/src/components/SubTopicScheduleView.tsx": "Modal displaying detailed revision schedule for a subtopic including all planned revision dates, progress tracking, overdue status, and actions to mark as reviewed or reschedule to next day.",
  "frontend/src/components/TodayView.tsx": "Dashboard view showing overdue and due-today revision items with ability to mark subtopics as reviewed, grouped by overdue vs. today with difficulty badges and review counts.",
  "frontend/src/components/TopicDetailView.tsx": "Modal showing all subtopics for a main topic, separated into active and completed sections, with click-through to individual subtopic schedules and review count display.",
  "frontend/src/components/TopicDialog.tsx": "Tabbed dialog for creating/editing main topics and subtopics with fields for title, description, difficulty level, study date, and main topic selection for subtopics.",
  "frontend/src/components/TopicsView.tsx": "Main topics management view component that displays hierarchical topics with collapsible sub-topics, supports CRUD operations (create, edit, delete), completion status toggling, and integrates with TopicDialog, TopicDetailView, and SubTopicScheduleView components.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login/logout functionality, identity persistence, and configurable AuthClient options for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including user profiles, topics (main and sub), revision schedules, and CRUD mutations with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for backgrounds, foregrounds, borders, charts, and sidebar components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed navigation between Today, Topics, Calendar, and Settings views, using responsive icons and labels for mobile and desktop layouts.",
  "frontend/src/utils/reviewStatus.ts": "Utility functions for filtering and identifying subtopics based on revision schedules, including getting due subtopics for a date, planned subtopics, and missed revision dates.",
  "frontend/src/utils/time.ts": "Utility functions for converting between ICP Time (bigint nanoseconds) and JavaScript Date objects, plus date comparison, formatting, and grouping helpers for calendar functionality.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with hash-based and browser routing, including sessionStorage persistence and functions to extract, store, and clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended border radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a study revision tracker, listing existing features for manual review marking with green/red indicators and pending feature requests for persistent revision status."
}