{
  "backend/main.mo": "Main Motoko actor implementing a spaced repetition system with authorization, managing main topics, subtopics, revision schedules, user settings/profiles, and providing CRUD operations with configurable difficulty-based interval sequences.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: removing reviews-needing-action indicator from CalendarView, adding reschedule-to-next-day action in SubTopicScheduleView, and updating TodayView to show both today's and overdue topics separately.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose and key functionality, including components for authentication, topic management, calendar views, settings, and utility functions.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with a neutral grayscale palette.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, profile setup modal display, theme provider initialization, and conditional rendering of dashboard or welcome screen based on authentication state.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar component displaying study and revision dates with difficulty indicators, showing only scheduled topics when a date is clicked (reviews-needing-action section removed).",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with branding (Brain icon and title), theme toggle button (light/dark mode), and login/logout button with authentication state handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name input, non-dismissible until profile is saved.",
  "frontend/src/components/SettingsView.tsx": "Settings component for configuring spaced repetition intervals (easy/medium/hard) and preferred review days. Allows users to add/remove interval values and toggle days of the week, with support for loading defaults and saving custom settings.",
  "frontend/src/components/SubTopicScheduleView.tsx": "Dialog component displaying a subtopic's complete revision schedule including study date and all planned revision dates. Shows progress metrics, completion status, overdue indicators, and provides a button to reschedule overdue revisions to the next day.",
  "frontend/src/components/TodayView.tsx": "Dashboard view showing subtopics due for review on a selected date, categorized into 'due today' and 'overdue'. Provides date selection, displays difficulty badges, and allows marking reviews as completed.",
  "frontend/src/components/TopicDetailView.tsx": "Dialog component displaying a main topic's details and all its subtopics, separated into active and completed sections. Each subtopic card shows difficulty, study date, and provides a button to view its full revision schedule.",
  "frontend/src/components/TopicDialog.tsx": "Tabbed dialog for creating/editing both main topics and subtopics. Handles form inputs for title, description, difficulty selection, study date picker, and main topic association for subtopics.",
  "frontend/src/components/TopicsView.tsx": "Main topics management UI component that displays a hierarchical collapsible list of main topics and subtopics with CRUD operations, completion toggling, difficulty badges, and detail/schedule views.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, creating an authenticated or anonymous actor based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, topics, subtopics, revision schedules, and planned revision dates with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes for UI components including primary, secondary, accent, destructive, and sidebar colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component with tabbed navigation between Today, Topics, Calendar, and Settings views using shadcn/ui Tabs component.",
  "frontend/src/utils/reviewStatus.ts": "Utility functions for calculating due/overdue reviews and planned study/revision items for specific dates by comparing subtopic schedules against target dates.",
  "frontend/src/utils/time.ts": "Utility functions for converting between ICP Time (bigint nanoseconds) and JavaScript Date objects, plus date comparison, formatting, and grouping helpers for calendar events.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a study/revision scheduling app with known issues around the Today dashboard not properly displaying due vs overdue topics and calendar duplication problems for missed items."
}