{
  "backend/main.mo": "Motoko backend defining topics, subtopics, revision schedules, user profiles, and authorization checks with CRUD and interval‑retrieval logic.",
  "feature_evidence.json": "Feature evidence report linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of major frontend files and utilities.",
  "frontend/index.css": "Tailwind and OKLCH‑based global theme variables and styling for light and dark modes.",
  "frontend/index.html": "Base HTML document bootstrapping the React frontend and loading the main application entrypoint.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile initialization, theming, and routing into the dashboard.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar showing study and planned revision events plus due/pending reviews using shared reviewStatus logic.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding, theme toggle, and login/logout logic integrated with Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and save their profile via backend mutation.",
  "frontend/src/components/SettingsView.tsx": "Manages user settings for study intervals and preferred review days, loading defaults and saving updates. Provides UI for editing interval lists and toggling review days.",
  "frontend/src/components/SubTopicScheduleView.tsx": "Displays a dialog showing a subtopic’s study and revision dates, including status indicators. Fetches planned revision dates and renders them with contextual styling.",
  "frontend/src/components/TodayView.tsx": "Shows the daily revision dashboard with due and overdue subtopics based on selected date. Allows marking reviews as completed and reviewing schedule details.",
  "frontend/src/components/TopicDetailView.tsx": "Displays details of a main topic along with its subtopics, separating active and completed ones. Supports opening a schedule view for individual subtopics.",
  "frontend/src/components/TopicDialog.tsx": "Dialog for creating or editing main topics and subtopics, including fields for titles, descriptions, difficulty, and study dates. Submits changes via mutation hooks.",
  "frontend/src/components/TopicsView.tsx": "UI component that displays main topics and subtopics with editing, deleting, viewing, scheduling, and completion actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating topics, user profiles, schedules, and related backend data.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and base styling.",
  "frontend/src/main.tsx": "Application entry point that initializes React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page with tabbed navigation between Today, Topics, Calendar, and Settings views.",
  "frontend/src/utils/reviewStatus.ts": "Utility functions to compute due reviews and planned study/revision items for a given date.",
  "frontend/src/utils/time.ts": "Provides conversions between bigint ICP timestamps and JS Dates, plus helpers for day boundaries, date comparisons, and generating date keys.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash routing) and persisting them in sessionStorage with optional cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata outlining the scheduling app’s purpose, architectural notes, known issues, and existing feature requirements."
}