{
  "kind": "build_request",
  "title": "Show revision completion status and progress in Subtopic Schedule view",
  "projectName": "Revision Planner",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Update the Subtopic revision schedule dialog (`frontend/src/components/SubTopicScheduleView.tsx`) to display a progress indicator showing how many revisions have been completed out of the total planned revisions for that subtopic (e.g., \"4/5\" and/or \"1/5 remaining\"). Use English for any user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "suppose I have to revise it 5 times totally give number by side that how many times I have revise like 4/5 or remaining 1/5 like that"
        ]
      },
      "acceptanceCriteria": [
        "When a user opens a subtopic schedule dialog, the UI shows a progress indicator for revisions completed out of total planned revisions (e.g., \"Progress: 4/5\" or \"1/5 remaining\").",
        "Total planned revisions are computed consistently with the existing planned revision dates returned by `useGetPlannedRevisionDates` (i.e., the denominator matches the number of planned revision sessions shown, excluding the initial \"Study Date\").",
        "The completed count uses the existing subtopic data (e.g., `subTopic.currentIntervalIndex`) and is capped to the total planned revisions so the UI never displays values like \"6/5\"."
      ]
    },
    {
      "id": "REQ-12",
      "text": "In the Subtopic revision schedule list (`frontend/src/components/SubTopicScheduleView.tsx`), visually indicate each scheduled session’s completion status: show completed sessions in green (completed on the scheduled date or later), and show past sessions that are not completed in red; keep upcoming sessions in a neutral style. Use English for any status labels/badges.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "if I complete the revision according to schedule or later show in green if not in read"
        ]
      },
      "acceptanceCriteria": [
        "For a subtopic with some completed revisions, the earliest N revision sessions (where N is the completed revision count) are styled as completed (green).",
        "For any revision session with a date before today that is not yet completed, the session is styled as not completed/overdue (red).",
        "Sessions on today or in the future that are not completed are not red; they remain neutral (or use existing today/upcoming styling) and do not appear as completed.",
        "All new/updated user-visible labels (e.g., \"Completed\", \"Overdue\", \"Progress\") are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify any frontend files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only introduce migrations if state schema changes (not expected for this request)."
  ],
  "nonGoals": [
    "Do not add new authentication methods (Internet Identity remains the only auth).",
    "Do not introduce new backend services or external databases.",
    "Do not change the calendar logic or today-dashboard due/overdue definitions as part of this request (only the subtopic schedule dialog presentation)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}