{
  "kind": "build_request",
  "title": "Remove 'reviews needing action' from calendar, add redo-next-day option in schedule, and show today + overdue in dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "In CalendarView (frontend/src/components/CalendarView.tsx), remove the 'reviews needing action' indicator/count and display only the topics scheduled to be revised when the user clicks on a particular date.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "In calendar view I don't need reviews needing action just show topics to be revised when I click on a particular date"
        ]
      },
      "acceptanceCriteria": [
        "Calendar view no longer displays a 'reviews needing action' count or badge.",
        "Clicking a date in the calendar shows only the topics/subtopics scheduled for revision on that date.",
        "The date detail panel does not show overdue carry-over items or due/pending counts."
      ]
    },
    {
      "id": "REQ-14",
      "text": "In SubTopicScheduleView (frontend/src/components/SubTopicScheduleView.tsx), add a user action (button or link) to reschedule a missed revision to the next day. When activated, update the subtopic's nextReview date to tomorrow and recalculate all future revision dates accordingly by calling the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "whenever I click a subtopic and view schedule add an option to redo revision next day if not done on particular day so accordingly modify the future dates"
        ]
      },
      "acceptanceCriteria": [
        "SubTopicScheduleView displays a 'Redo revision tomorrow' button or similar option for missed (overdue, not completed) sessions.",
        "Clicking the option triggers a backend call that sets nextReview to tomorrow's date and recalculates the subtopic's future scheduled revision dates.",
        "The updated schedule is reflected immediately in the UI.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add a backend method (e.g., rescheduleRevisionToNextDay) that accepts a subtopic ID, sets its nextReview to the day after the current date, and regenerates future revision dates based on the existing schedule intervals. Return the updated schedule.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "add an option to redo revision next day if not done on particular day so accordingly modify the future dates"
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a method to reschedule a subtopic's nextReview to tomorrow.",
        "The method recalculates all future revision dates starting from tomorrow using the subtopic's interval schedule.",
        "The method returns the updated schedule or subtopic state.",
        "Access control ensures only the owner (or admin) can reschedule."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update TodayView (frontend/src/components/TodayView.tsx) so the dashboard shows both (a) topics to be revised today (subtopics with nextReview matching the selected date) and (b) topics that are due or missed from previous days (overdue carry-over). Clearly distinguish these two groups in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Dashboard should show things to be revised today and things which are due or missed previous day"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard (TodayView) displays subtopics scheduled for today separately from overdue/missed subtopics.",
        "Each group is labeled appropriately (e.g., 'Due Today' and 'Overdue/Missed').",
        "The combined count reflects all items needing attention (today + overdue).",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not change frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Respect the single-actor architecture; all Motoko logic remains in backend/main.mo.",
    "Use existing backend methods and query patterns; do not introduce new state types unless necessary."
  ],
  "nonGoals": [
    "Do not change the overall spaced-repetition algorithm or interval logic.",
    "Do not alter the Topics or Settings views.",
    "Do not modify authentication or profile setup flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}