{
  "kind": "build_request",
  "title": "Fix discrepancy between Calendar and Dashboard due-review counts",
  "projectName": "Revision Tracker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Update the Calendar view so it clearly distinguishes between (a) planned revision sessions shown on the calendar and (b) reviews that are actually due/pending on the selected date, and ensure completed subtopics are not counted as due/pending.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In calendar there are 5 topics to be revised today whereas in dashboard to be revised is only one topic there is discrepancy kindly modify it"
        ]
      },
      "acceptanceCriteria": [
        "In CalendarView, the selected-day details panel shows separate counts for: (1) planned items (study + planned revisions) and (2) due/pending reviews for that date (excluding completed subtopics).",
        "CalendarView does not label all planned revisions on the selected date as 'due'; it uses user-facing text that makes the distinction explicit in English.",
        "Completed subtopics are excluded from the CalendarView 'due/pending' count and due/pending list."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure the Dashboard (Today/selected-date) 'to review' count matches the Calendar view's 'due/pending reviews' count for the same selected date by using the same definition of 'due/pending' (nextReview on the selected date, plus overdue carry-over; exclude completed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "See in dashboard still the topics to be revised today isn't showing properly"
        ]
      },
      "acceptanceCriteria": [
        "When the selected date in TodayView is the same day selected in CalendarView, the TodayView total 'to review' count equals the CalendarView 'due/pending reviews' count.",
        "TodayView continues to show both categories: overdue (before selected date) and due on selected date, and excludes completed subtopics from both lists.",
        "All user-facing text remains in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Respect the single-actor Motoko backend architecture (no additional backend services)."
  ],
  "nonGoals": [
    "Do not change the spaced-repetition interval algorithm or how planned revision dates are generated.",
    "Do not add real-time updates (e.g., WebSockets) or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}