{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Align Calendar vs Dashboard due/pending review counts",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Update CalendarView to separate planned calendar items from due/pending reviews for the selected date, excluding completed subtopics from due/pending.",
      "acceptanceCriteria": [
        "In CalendarView, the selected-day details panel shows separate counts for: (1) planned items (study + planned revisions) and (2) due/pending reviews for that date (excluding completed subtopics).",
        "CalendarView does not label all planned revisions on the selected date as 'due'; it uses user-facing text that makes the distinction explicit in English.",
        "Completed subtopics are excluded from the CalendarView 'due/pending' count and due/pending list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/reviewStatus.ts",
          "operation": "create",
          "description": "Add shared, date-based helper(s) to compute the app-wide definition of due/pending reviews for a selected date (due on date + overdue carry-over; exclude completed) using subtopics + revision schedules, so CalendarView and TodayView can share identical logic."
        },
        {
          "path": "frontend/src/components/CalendarView.tsx",
          "operation": "modify",
          "description": "Update the selected-day details panel UI to clearly separate (A) planned items shown on the calendar (study + planned revision sessions) from (B) due/pending reviews for that selected date, computed via the shared reviewStatus helper and revision schedules; ensure completed subtopics never appear in due/pending counts/lists; adjust user-facing English text so planned items are not labeled as due."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Ensure TodayView 'to review' count matches CalendarView due/pending definition for the same selected date (due on date + overdue; exclude completed) and continues to display overdue vs due-on-date categories.",
      "acceptanceCriteria": [
        "When the selected date in TodayView is the same day selected in CalendarView, the TodayView total 'to review' count equals the CalendarView 'due/pending reviews' count.",
        "TodayView continues to show both categories: overdue (before selected date) and due on selected date, and excludes completed subtopics from both lists.",
        "All user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TodayView.tsx",
          "operation": "modify",
          "description": "Refactor TodayView to compute overdue + due-on-selected-date from the same shared reviewStatus helper used by CalendarView (based on revision schedules nextReview plus overdue carry-over; exclude completed) so the displayed total 'to review' count and the two category lists always match the CalendarView due/pending reviews definition for the same selected date."
        }
      ]
    }
  ]
}