{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Filter redo tomorrow to exclude completed revisions",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the frontend redo tomorrow button to reflect that only incomplete revisions will be rescheduled",
      "acceptanceCriteria": [
        "The redo tomorrow action correctly calls the backend with the filter logic",
        "User understands that only unmarked revisions will be rescheduled",
        "The UI reflects the updated schedule after the redo operation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubTopicScheduleView.tsx",
          "operation": "modify",
          "description": "Update the redo tomorrow button handler to work with the backend's filtering logic that only reschedules incomplete revisions. Add visual feedback showing how many incomplete revisions will be rescheduled. Update the button's tooltip or label to clarify that only unmarked (incomplete) revisions are affected. Ensure the mutation callback properly refreshes the schedule data after the reschedule operation completes."
        },
        {
          "path": "frontend/src/components/CalendarView.tsx",
          "operation": "modify",
          "description": "Ensure the calendar view correctly reflects the updated schedule after a redo tomorrow operation, showing that only incomplete revisions were rescheduled. Verify that completed revision indicators (green status) remain unchanged and new dates only appear for previously incomplete revisions."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that the rescheduleRevisionToNextDay mutation properly invalidates and refetches related queries (revision schedules, subtopics with study dates, calendar data) to ensure the UI reflects the backend's filtered rescheduling. Add appropriate toast notifications to inform users about the number of incomplete revisions that were rescheduled."
        }
      ]
    }
  ]
}