{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Date-based due reviews on Today dashboard and subtopic schedule drilldown",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add a selected-date context to the Today dashboard, querying and displaying both overdue and due-on-date subtopics for that date.",
      "acceptanceCriteria": [
        "The Today tab includes a date selector (English labels) that changes the dashboard’s due-items query context to the selected date.",
        "When the selected date changes, the dashboard refreshes to show subtopics due on that date plus overdue subtopics (earlier than the selected date).",
        "The UI clearly distinguishes “Overdue” vs “Due on selected date” (e.g., section headers/badges) using English text.",
        "Empty states and counts reflect the selected date context (e.g., if nothing is due/overdue for that date, show a clear English empty state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook (e.g., useGetSubTopicsForDate) that calls the backend capability for fetching subtopics due on/before a selected day (using the existing actor method that accepts a target date). Ensure the hook uses a queryKey that includes the selected date value so results refetch and cache correctly when the user changes the date."
        },
        {
          "path": "frontend/src/utils/time.ts",
          "operation": "modify",
          "description": "Add date-context helpers to support a selected-day dashboard view (e.g., converting a local Date start-of-day to ICP Time bigint, checking if a schedule time is before a selected day, and checking if a schedule time is on the selected day). Keep all logic timezone-consistent with existing start-of-day normalization."
        },
        {
          "path": "frontend/src/components/TodayView.tsx",
          "operation": "modify",
          "description": "Update the Today dashboard UI to include a date selector with English labeling and to drive the due-items query using the selected date. Replace today-only categorization with selected-date categorization: split results into two sections with clear English headers/badges (\"Overdue\" vs \"Due on selected date\"). Update summary text, counts, and empty states to reflect the selected date context. Continue to use existing shadcn-ui components (e.g., Card/Badge/Button and an existing input/date control) for layout and styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Enable subtopic-level revision schedule drilldown from Topics: main topic shows subtopic list; clicking any subtopic (including completed) opens its schedule view.",
      "acceptanceCriteria": [
        "From the Topics tab, clicking a subtopic row (or an explicit “View schedule” action) opens a dedicated view (dialog/drawer/page) showing that subtopic’s revision schedule.",
        "Completed subtopics are also clickable and show their revision schedule (not just active subtopics).",
        "The “View All” main-topic detail experience no longer forces displaying every subtopic schedule at once; it should prioritize showing the subtopic list and allow schedule viewing per subtopic click.",
        "All user-facing UI text introduced/changed for this navigation is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubTopicScheduleView.tsx",
          "operation": "create",
          "description": "Create a dedicated subtopic schedule view as a Dialog (or similar) that displays the selected subtopic’s revision schedule dates. Use existing shadcn-ui Dialog/Card/Badge components and existing planned-revision query hook(s) to render the schedule; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TopicDetailView.tsx",
          "operation": "modify",
          "description": "Refactor the main-topic detail dialog to prioritize a subtopics list (including completed subtopics) rather than rendering every subtopic schedule inline. Make each subtopic row clickable (or add an explicit \"View schedule\" action) to open SubTopicScheduleView for that subtopic. Ensure all new/changed labels are in English. Continue composing existing shadcn-ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TopicsView.tsx",
          "operation": "modify",
          "description": "Adjust Topics tab interactions so the main-topic \"View All\" flow opens the updated TopicDetailView that focuses on the subtopic list and supports schedule drilldown. Ensure completed subtopics are presented as clickable in the main-topic detail experience (via TopicDetailView) and that any newly introduced UI text is English."
        }
      ]
    }
  ]
}