{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Subtopic Schedule: show revision progress and completion/overdue styling",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Show a revision progress indicator (completed/total and remaining) in the Subtopic Schedule dialog, consistent with planned revision dates.",
      "acceptanceCriteria": [
        "When a user opens a subtopic schedule dialog, the UI shows a progress indicator for revisions completed out of total planned revisions (e.g., \"Progress: 4/5\" or \"1/5 remaining\").",
        "Total planned revisions are computed consistently with the existing planned revision dates returned by `useGetPlannedRevisionDates` (i.e., the denominator matches the number of planned revision sessions shown, excluding the initial \"Study Date\").",
        "The completed count uses the existing subtopic data (e.g., `subTopic.currentIntervalIndex`) and is capped to the total planned revisions so the UI never displays values like \"6/5\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubTopicScheduleView.tsx",
          "operation": "modify",
          "description": "Compute total planned revisions from `plannedDates.length` (excluding the study date) and compute completed revisions from `subTopic.currentIntervalIndex` capped to the total; render an English progress indicator near the \"Revision Schedule\" header (e.g., using existing shadcn/ui Badge or muted text). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Visually mark each scheduled revision session as Completed (green), Overdue (red), or neutral for upcoming/today in the Subtopic Schedule list.",
      "acceptanceCriteria": [
        "For a subtopic with some completed revisions, the earliest N revision sessions (where N is the completed revision count) are styled as completed (green).",
        "For any revision session with a date before today that is not yet completed, the session is styled as not completed/overdue (red).",
        "Sessions on today or in the future that are not completed are not red; they remain neutral (or use existing today/upcoming styling) and do not appear as completed.",
        "All new/updated user-visible labels (e.g., \"Completed\", \"Overdue\", \"Progress\") are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubTopicScheduleView.tsx",
          "operation": "modify",
          "description": "Update the schedule row rendering to derive a per-row completion status for revision items (excluding the \"Study Date\" row): mark the earliest N revision rows as Completed (green) where N is the capped completed count; mark past (before today) non-completed revision rows as Overdue (red); keep today/future non-completed rows neutral while preserving existing today/upcoming badges. Add English status badges/labels using existing shadcn/ui Badge styling (no edits under `frontend/src/components/ui`). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}