{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove calendar review indicators, add redo-next-day option, and enhance dashboard with overdue items",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Remove 'reviews needing action' indicator from CalendarView and show only scheduled topics when clicking a date",
      "acceptanceCriteria": [
        "Calendar view no longer displays a 'reviews needing action' count or badge.",
        "Clicking a date in the calendar shows only the topics/subtopics scheduled for revision on that date.",
        "The date detail panel does not show overdue carry-over items or due/pending counts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CalendarView.tsx",
          "operation": "modify",
          "description": "Remove the 'reviews needing action' indicator and count logic from the calendar. Update the date cell click handler to show only subtopics scheduled for revision on the selected date (filtering by nextReview matching the date), excluding overdue carry-over items. Remove any UI elements displaying due/pending counts in the date detail panel."
        },
        {
          "path": "frontend/src/utils/reviewStatus.ts",
          "operation": "modify",
          "description": "Update or add utility functions to filter subtopics by exact date match (nextReview equals target date) without including overdue items, ensuring CalendarView can fetch only the scheduled revisions for a specific date."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add 'Redo revision tomorrow' option in SubTopicScheduleView to reschedule missed revisions",
      "acceptanceCriteria": [
        "SubTopicScheduleView displays a 'Redo revision tomorrow' button or similar option for missed (overdue, not completed) sessions.",
        "Clicking the option triggers a backend call that sets nextReview to tomorrow's date and recalculates the subtopic's future scheduled revision dates.",
        "The updated schedule is reflected immediately in the UI.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubTopicScheduleView.tsx",
          "operation": "modify",
          "description": "Add a 'Redo revision tomorrow' button that is visible when the subtopic is overdue (nextReview is before today) and not completed. Wire the button to call actor.rescheduleRevisionToNextDay(subTopicId) from the backend interface. After the call succeeds, invalidate relevant queries to refresh the UI with updated schedule dates. Display appropriate success or error messages to the user."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (e.g., useRescheduleRevisionToNextDay) that wraps the actor.rescheduleRevisionToNextDay backend method. Configure the mutation to invalidate queries for revision schedules, subtopics, and planned dates upon success, ensuring the UI reflects the updated nextReview and future dates immediately."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Update TodayView to show both today's scheduled reviews and overdue items as separate groups",
      "acceptanceCriteria": [
        "Dashboard (TodayView) displays subtopics scheduled for today separately from overdue/missed subtopics.",
        "Each group is labeled appropriately (e.g., 'Due Today' and 'Overdue/Missed').",
        "The combined count reflects all items needing attention (today + overdue).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TodayView.tsx",
          "operation": "modify",
          "description": "Split the subtopic list into two sections: 'Due Today' (subtopics with nextReview matching the selected date) and 'Overdue/Missed' (subtopics with nextReview before the selected date and not completed). Render each section with a clear label and visual distinction. Update the header count to reflect the combined total of both groups (today + overdue). Ensure both sections support marking reviews as completed."
        },
        {
          "path": "frontend/src/utils/reviewStatus.ts",
          "operation": "modify",
          "description": "Add or enhance utility functions to separate subtopics into 'due today' (nextReview matches target date) and 'overdue' (nextReview is before target date, not completed) groups. Ensure TodayView can easily consume these grouped results for rendering distinct sections."
        }
      ]
    }
  ]
}